Autodesk.Revit.DB.ForgeTypeId.StrictlyEquals(Autodesk.Revit.DB.ForgeTypeId)
Returns true if the entire typeid string held by this ForgeTypeId is exactly equal to that held by the given
ForgeTypeId.
For the default equality comparison used by the equality operator (==), see
NameEquals(ForgeTypeId).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.ForgeTypeId.NameEquals(Autodesk.Revit.DB.ForgeTypeId)
Returns true if the typeid string held by this ForgeTypeId is equal to that held by the given ForgeTypeId,
excluding the version number. The version number of a typeid string follows a hyphen character. This function
compares the typeid strings up to the first hyphen. This is the default equality comparison method for the
ForgeTypeId class, used by the equality operator (==).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.ForgeTypeId.TypeId
The schema identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.ForgeTypeId.#ctor(System.String)
Constructs a ForgeTypeId holding the given schema identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021